{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}D:\work\Peter_Herman\projects\trade_network_research\files_used_in_submission\gravity_analysis\full_specifications\log_gravity_estimation.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 9 Jan 2021, 11:39:13
{txt}
{com}. set more off
{txt}
{com}. 
. use "D:\work\Peter_Herman\projects\trade_network_research\files_used_in_submission\data\gravity_estimation_data.dta", clear
{txt}(Written by R.              )

{com}. 
. tostring year, gen(year_str)
{txt}year_str generated as {res:str4}

{com}. tostring importer, gen(imp)
{txt}imp generated as {res:str3}

{com}. gen imp_year = imp+ "_" + year_str
{txt}
{com}. 
. tostring exporter, gen(exp)
{txt}exp generated as {res:str3}

{com}. gen exp_year = exp+ "_" + year_str
{txt}
{com}. 
. qui tab exporter, gen(exp_fe)
{txt}
{com}. qui tab importer, gen(imp_fe)
{txt}
{com}. qui tab year, gen(year_fe)
{txt}
{com}. qui tab imp_year, gen(imp_year_fe)
{txt}
{com}. qui tab exp_year, gen(exp_year_fe)
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\PETER~1.HER\AppData\Local\Temp\20\STDf5ec_000000.tmp"
{txt}
{com}. * Generate Remotness measures based on Baldwin and Harrigan (2011)
. gen weighted_dist_o = distw*gdp_o
{txt}(81,164 missing values generated)

{com}. bysort exp_year: egen lnremoteness_o=sum(weighted_dist_o)
{txt}
{com}. replace lnremoteness_o=log(1/lnremoteness_o)
{txt}(511,704 real changes made, 81,164 to missing)

{com}. 
. gen weighted_dist_d = distw*gdp_d
{txt}(81,164 missing values generated)

{com}. bysort imp_year: egen lnremoteness_d=sum(weighted_dist_d)
{txt}
{com}. replace lnremoteness_d=log(1/lnremoteness_d)
{txt}(511,704 real changes made, 81,164 to missing)

{com}. 
. 
. 
. * -----
. * Conduct Probit Analysis
. * -----
. 
. 
. * Traditional Specification with country-year fixed effects
. probit traded lndist contig comlang_ethno colony rta  imp_year_fe* exp_year_fe*, vce(cluster clusterid) noconstant

{txt}note: exp_year_fe2398 != 0 predicts success perfectly
      exp_year_fe2398 dropped and 206 obs not used

note: exp_year_fe2400 != 0 predicts success perfectly
      exp_year_fe2400 dropped and 206 obs not used

{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

end of do-file

{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}D:\work\Peter_Herman\projects\trade_network_research\files_used_in_submission\gravity_analysis\full_specifications\log_gravity_estimation.txt
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 9 Jan 2021, 12:04:33
{txt}{.-}
{smcl}
{txt}{sf}{ul off}