{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}D:\work\Peter_Herman\projects\trade_network_revisions_2020\github_repo\new analysis\comparisons\2006\2006_results\2006_partial_gravity_log.txt 
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 2 Feb 2021, 14:42:33
{txt}
{com}. set more off
{txt}
{com}. 
. local use_year 2006
{txt}
{com}. 
. import delimited "D:\work\Peter_Herman\projects\trade_network_revisions_2020\github_repo\new analysis\comparisons\partial_data_set_hs36_top50_with_ntw_vars.csv", varnames(1) clear
{res}{text}(30 vars, 29,400 obs)

{com}. 
. 
. keep if year == `use_year'
{txt}(26,950 observations deleted)

{com}. 
. * fix the fact that the missing values are reading in as "NA" and, as a result, GDP is being loaded as strings.
. replace gdp_o = "." if gdp_o == "NA"
{txt}(147 real changes made)

{com}. destring gdp_o, replace
{txt}gdp_o: all characters numeric; {res}replaced {txt}as {res}double
{txt}(147 missing values generated)
{res}{txt}
{com}. 
. replace gdp_d = "." if gdp_d == "NA"
{txt}(147 real changes made)

{com}. destring gdp_d, replace
{txt}gdp_d: all characters numeric; {res}replaced {txt}as {res}double
{txt}(147 missing values generated)
{res}{txt}
{com}. 
. replace lngdp_o = "." if lngdp_o == "NA"
{txt}(147 real changes made)

{com}. destring lngdp_o, replace
{txt}lngdp_o: all characters numeric; {res}replaced {txt}as {res}double
{txt}(147 missing values generated)
{res}{txt}
{com}. 
. replace lngdp_d = "." if lngdp_d == "NA"
{txt}(147 real changes made)

{com}. destring lngdp_d, replace
{txt}lngdp_d: all characters numeric; {res}replaced {txt}as {res}double
{txt}(147 missing values generated)
{res}{txt}
{com}. 
. replace lngdpcap_o = "." if lngdpcap_o == "NA"
{txt}(147 real changes made)

{com}. destring lngdpcap_o, replace
{txt}lngdpcap_o: all characters numeric; {res}replaced {txt}as {res}double
{txt}(147 missing values generated)
{res}{txt}
{com}. 
. replace lngdpcap_d = "." if lngdpcap_d == "NA"
{txt}(147 real changes made)

{com}. destring lngdpcap_d, replace
{txt}lngdpcap_d: all characters numeric; {res}replaced {txt}as {res}double
{txt}(147 missing values generated)
{res}{txt}
{com}. 
. 
. * Create fixed effects
. tostring year, gen(year_str)
{txt}year_str generated as {res:str4}

{com}. gen imp_year = importer+ "_" + year_str
{txt}
{com}. gen exp_year = exporter+ "_" + year_str
{txt}
{com}. 
. qui tab exporter, gen(exp_fe)
{txt}
{com}. qui tab importer, gen(imp_fe)
{txt}
{com}. qui tab year, gen(year_fe)
{txt}
{com}. qui tab imp_year, gen(imp_year_fe)
{txt}
{com}. qui tab exp_year, gen(exp_year_fe)
{txt}
{com}. 
. * Create Cluster ID
. gen clusterid = exporter+importer
{txt}
{com}. 
. 
. * Generate Remotness measures based on Baldwin and Harrigan (2011)
. gen distw = exp(lndist)
{txt}
{com}. 
. gen weighted_dist_o = gdp_d/distw
{txt}(147 missing values generated)

{com}. bysort exp_year: egen remoteness_o=sum(weighted_dist_o)
{txt}
{com}. replace remoteness_o=1/remoteness_o
{txt}(2,450 real changes made)

{com}. gen lnremoteness_o = log(remoteness_o)
{txt}
{com}. 
. gen weighted_dist_d = gdp_o/distw
{txt}(147 missing values generated)

{com}. bysort imp_year: egen remoteness_d=sum(weighted_dist_d)
{txt}
{com}. replace remoteness_d=1/remoteness_d
{txt}(2,450 real changes made)

{com}. gen lnremoteness_d = log(remoteness_d)
{txt}
{com}. 
. 
. // Conduct Estimations
. probit traded lndist contig comlang_ethno colony rta exp_fe*  imp_fe*, vce(robust) noconstant

{txt}note: exp_fe10 != 0 predicts success perfectly
      exp_fe10 dropped and 49 obs not used

note: exp_fe12 != 0 predicts success perfectly
      exp_fe12 dropped and 49 obs not used

note: exp_fe14 != 0 predicts failure perfectly
      exp_fe14 dropped and 49 obs not used

note: exp_fe32 != 0 predicts failure perfectly
      exp_fe32 dropped and 49 obs not used

note: imp_fe50 omitted because of collinearity
{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-1562.3537}  
Iteration 1:{space 3}log pseudolikelihood = {res:-843.83272}  
Iteration 2:{space 3}log pseudolikelihood = {res:-819.28472}  
Iteration 3:{space 3}log pseudolikelihood = {res:-818.75093}  
Iteration 4:{space 3}log pseudolikelihood = {res:-818.74881}  
Iteration 5:{space 3}log pseudolikelihood = {res:-818.74881}  
{res}
{txt}Probit regression{col 49}Number of obs{col 67}= {res}     2,254
{txt}{col 49}Wald chi2({res}100{txt}){col 67}= {res}    775.96
{txt}Log pseudolikelihood = {res}-818.74881{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}       traded{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lndist {c |}{col 15}{res}{space 2}-1.068668{col 27}{space 2} .0863934{col 38}{space 1}  -12.37{col 47}{space 3}0.000{col 55}{space 4}-1.237996{col 68}{space 3}-.8993396
{txt}{space 7}contig {c |}{col 15}{res}{space 2} .5536913{col 27}{space 2} .2434865{col 38}{space 1}    2.27{col 47}{space 3}0.023{col 55}{space 4} .0764666{col 68}{space 3} 1.030916
{txt}comlang_ethno {c |}{col 15}{res}{space 2} .3877503{col 27}{space 2} .1596889{col 38}{space 1}    2.43{col 47}{space 3}0.015{col 55}{space 4} .0747658{col 68}{space 3} .7007347
{txt}{space 7}colony {c |}{col 15}{res}{space 2} .9153528{col 27}{space 2} .2792714{col 38}{space 1}    3.28{col 47}{space 3}0.001{col 55}{space 4} .3679909{col 68}{space 3} 1.462715
{txt}{space 10}rta {c |}{col 15}{res}{space 2}-.0120009{col 27}{space 2} .1383088{col 38}{space 1}   -0.09{col 47}{space 3}0.931{col 55}{space 4} -.283081{col 68}{space 3} .2590793
{txt}{space 6}exp_fe1 {c |}{col 15}{res}{space 2} 8.631687{col 27}{space 2} .8452003{col 38}{space 1}   10.21{col 47}{space 3}0.000{col 55}{space 4} 6.975125{col 68}{space 3} 10.28825
{txt}{space 6}exp_fe2 {c |}{col 15}{res}{space 2} 9.808361{col 27}{space 2} .9390318{col 38}{space 1}   10.45{col 47}{space 3}0.000{col 55}{space 4} 7.967893{col 68}{space 3} 11.64883
{txt}{space 6}exp_fe3 {c |}{col 15}{res}{space 2} 10.89099{col 27}{space 2} .9246637{col 38}{space 1}   11.78{col 47}{space 3}0.000{col 55}{space 4} 9.078687{col 68}{space 3}  12.7033
{txt}{space 6}exp_fe4 {c |}{col 15}{res}{space 2} 10.49812{col 27}{space 2} .8704959{col 38}{space 1}   12.06{col 47}{space 3}0.000{col 55}{space 4} 8.791977{col 68}{space 3} 12.20426
{txt}{space 6}exp_fe5 {c |}{col 15}{res}{space 2} 10.61505{col 27}{space 2}  .869062{col 38}{space 1}   12.21{col 47}{space 3}0.000{col 55}{space 4} 8.911724{col 68}{space 3} 12.31838
{txt}{space 6}exp_fe6 {c |}{col 15}{res}{space 2} 11.45696{col 27}{space 2}  .925013{col 38}{space 1}   12.39{col 47}{space 3}0.000{col 55}{space 4} 9.643963{col 68}{space 3} 13.26995
{txt}{space 6}exp_fe7 {c |}{col 15}{res}{space 2} 11.09189{col 27}{space 2} .9017602{col 38}{space 1}   12.30{col 47}{space 3}0.000{col 55}{space 4} 9.324475{col 68}{space 3} 12.85931
{txt}{space 6}exp_fe8 {c |}{col 15}{res}{space 2} 10.55699{col 27}{space 2}  .881537{col 38}{space 1}   11.98{col 47}{space 3}0.000{col 55}{space 4} 8.829214{col 68}{space 3} 12.28478
{txt}{space 6}exp_fe9 {c |}{col 15}{res}{space 2} 10.27428{col 27}{space 2} .9732115{col 38}{space 1}   10.56{col 47}{space 3}0.000{col 55}{space 4} 8.366823{col 68}{space 3} 12.18174
{txt}{space 5}exp_fe10 {c |}{col 15}{res}{space 2}        0{col 27}{txt}  (omitted)
{space 5}exp_fe11 {c |}{col 15}{res}{space 2}  10.8565{col 27}{space 2} .8643434{col 38}{space 1}   12.56{col 47}{space 3}0.000{col 55}{space 4} 9.162418{col 68}{space 3} 12.55058
{txt}{space 5}exp_fe12 {c |}{col 15}{res}{space 2}        0{col 27}{txt}  (omitted)
{space 5}exp_fe13 {c |}{col 15}{res}{space 2} 10.77218{col 27}{space 2} .8683639{col 38}{space 1}   12.41{col 47}{space 3}0.000{col 55}{space 4} 9.070214{col 68}{space 3} 12.47414
{txt}{space 5}exp_fe14 {c |}{col 15}{res}{space 2}        0{col 27}{txt}  (omitted)
{space 5}exp_fe15 {c |}{col 15}{res}{space 2} 11.20053{col 27}{space 2} .8823074{col 38}{space 1}   12.69{col 47}{space 3}0.000{col 55}{space 4} 9.471237{col 68}{space 3} 12.92982
{txt}{space 5}exp_fe16 {c |}{col 15}{res}{space 2} 9.813416{col 27}{space 2} .8635191{col 38}{space 1}   11.36{col 47}{space 3}0.000{col 55}{space 4} 8.120949{col 68}{space 3} 11.50588
{txt}{space 5}exp_fe17 {c |}{col 15}{res}{space 2} 12.70415{col 27}{space 2} .9654623{col 38}{space 1}   13.16{col 47}{space 3}0.000{col 55}{space 4} 10.81188{col 68}{space 3} 14.59642
{txt}{space 5}exp_fe18 {c |}{col 15}{res}{space 2} 11.82457{col 27}{space 2}  .898141{col 38}{space 1}   13.17{col 47}{space 3}0.000{col 55}{space 4} 10.06425{col 68}{space 3} 13.58489
{txt}{space 5}exp_fe19 {c |}{col 15}{res}{space 2} 8.784096{col 27}{space 2} .8650938{col 38}{space 1}   10.15{col 47}{space 3}0.000{col 55}{space 4} 7.088543{col 68}{space 3} 10.47965
{txt}{space 5}exp_fe20 {c |}{col 15}{res}{space 2} 11.47451{col 27}{space 2} .9502645{col 38}{space 1}   12.08{col 47}{space 3}0.000{col 55}{space 4} 9.612029{col 68}{space 3}   13.337
{txt}{space 5}exp_fe21 {c |}{col 15}{res}{space 2} 9.709773{col 27}{space 2} .8521045{col 38}{space 1}   11.40{col 47}{space 3}0.000{col 55}{space 4} 8.039679{col 68}{space 3} 11.37987
{txt}{space 5}exp_fe22 {c |}{col 15}{res}{space 2} 10.12106{col 27}{space 2} .8942323{col 38}{space 1}   11.32{col 47}{space 3}0.000{col 55}{space 4} 8.368394{col 68}{space 3} 11.87372
{txt}{space 5}exp_fe23 {c |}{col 15}{res}{space 2} 10.81185{col 27}{space 2} .8749317{col 38}{space 1}   12.36{col 47}{space 3}0.000{col 55}{space 4} 9.097016{col 68}{space 3} 12.52668
{txt}{space 5}exp_fe24 {c |}{col 15}{res}{space 2} 9.702518{col 27}{space 2} .8778918{col 38}{space 1}   11.05{col 47}{space 3}0.000{col 55}{space 4} 7.981881{col 68}{space 3} 11.42315
{txt}{space 5}exp_fe25 {c |}{col 15}{res}{space 2} 8.529916{col 27}{space 2} .8511704{col 38}{space 1}   10.02{col 47}{space 3}0.000{col 55}{space 4} 6.861653{col 68}{space 3} 10.19818
{txt}{space 5}exp_fe26 {c |}{col 15}{res}{space 2} 9.052722{col 27}{space 2} .8861511{col 38}{space 1}   10.22{col 47}{space 3}0.000{col 55}{space 4} 7.315898{col 68}{space 3} 10.78955
{txt}{space 5}exp_fe27 {c |}{col 15}{res}{space 2} 11.22887{col 27}{space 2} .8727699{col 38}{space 1}   12.87{col 47}{space 3}0.000{col 55}{space 4} 9.518276{col 68}{space 3} 12.93947
{txt}{space 5}exp_fe28 {c |}{col 15}{res}{space 2}  11.6208{col 27}{space 2} .9025578{col 38}{space 1}   12.88{col 47}{space 3}0.000{col 55}{space 4} 9.851819{col 68}{space 3} 13.38978
{txt}{space 5}exp_fe29 {c |}{col 15}{res}{space 2} 11.26664{col 27}{space 2} .8988073{col 38}{space 1}   12.54{col 47}{space 3}0.000{col 55}{space 4} 9.505007{col 68}{space 3} 13.02827
{txt}{space 5}exp_fe30 {c |}{col 15}{res}{space 2} 9.507473{col 27}{space 2} .9547949{col 38}{space 1}    9.96{col 47}{space 3}0.000{col 55}{space 4}  7.63611{col 68}{space 3} 11.37884
{txt}{space 5}exp_fe31 {c |}{col 15}{res}{space 2} 10.66672{col 27}{space 2} .8865397{col 38}{space 1}   12.03{col 47}{space 3}0.000{col 55}{space 4} 8.929136{col 68}{space 3} 12.40431
{txt}{space 5}exp_fe32 {c |}{col 15}{res}{space 2}        0{col 27}{txt}  (omitted)
{space 5}exp_fe33 {c |}{col 15}{res}{space 2} 11.99807{col 27}{space 2} .9184198{col 38}{space 1}   13.06{col 47}{space 3}0.000{col 55}{space 4}   10.198{col 68}{space 3} 13.79814
{txt}{space 5}exp_fe34 {c |}{col 15}{res}{space 2} 9.688405{col 27}{space 2} .8550783{col 38}{space 1}   11.33{col 47}{space 3}0.000{col 55}{space 4} 8.012482{col 68}{space 3} 11.36433
{txt}{space 5}exp_fe35 {c |}{col 15}{res}{space 2}   9.2974{col 27}{space 2} .8965314{col 38}{space 1}   10.37{col 47}{space 3}0.000{col 55}{space 4}  7.54023{col 68}{space 3} 11.05457
{txt}{space 5}exp_fe36 {c |}{col 15}{res}{space 2} 9.999147{col 27}{space 2} .8467809{col 38}{space 1}   11.81{col 47}{space 3}0.000{col 55}{space 4} 8.339487{col 68}{space 3} 11.65881
{txt}{space 5}exp_fe37 {c |}{col 15}{res}{space 2} 9.115651{col 27}{space 2} .8748753{col 38}{space 1}   10.42{col 47}{space 3}0.000{col 55}{space 4} 7.400927{col 68}{space 3} 10.83038
{txt}{space 5}exp_fe38 {c |}{col 15}{res}{space 2} 8.529413{col 27}{space 2} .8392749{col 38}{space 1}   10.16{col 47}{space 3}0.000{col 55}{space 4} 6.884465{col 68}{space 3} 10.17436
{txt}{space 5}exp_fe39 {c |}{col 15}{res}{space 2}  9.87132{col 27}{space 2} .8436653{col 38}{space 1}   11.70{col 47}{space 3}0.000{col 55}{space 4} 8.217766{col 68}{space 3} 11.52487
{txt}{space 5}exp_fe40 {c |}{col 15}{res}{space 2} 8.443683{col 27}{space 2} .8748284{col 38}{space 1}    9.65{col 47}{space 3}0.000{col 55}{space 4} 6.729051{col 68}{space 3} 10.15832
{txt}{space 5}exp_fe41 {c |}{col 15}{res}{space 2} 11.08312{col 27}{space 2} .9119156{col 38}{space 1}   12.15{col 47}{space 3}0.000{col 55}{space 4} 9.295797{col 68}{space 3} 12.87044
{txt}{space 5}exp_fe42 {c |}{col 15}{res}{space 2} 9.212235{col 27}{space 2} .8513783{col 38}{space 1}   10.82{col 47}{space 3}0.000{col 55}{space 4} 7.543564{col 68}{space 3} 10.88091
{txt}{space 5}exp_fe43 {c |}{col 15}{res}{space 2} 11.88312{col 27}{space 2} .9075563{col 38}{space 1}   13.09{col 47}{space 3}0.000{col 55}{space 4} 10.10434{col 68}{space 3} 13.66189
{txt}{space 5}exp_fe44 {c |}{col 15}{res}{space 2} 11.54046{col 27}{space 2} .9246744{col 38}{space 1}   12.48{col 47}{space 3}0.000{col 55}{space 4} 9.728132{col 68}{space 3} 13.35279
{txt}{space 5}exp_fe45 {c |}{col 15}{res}{space 2} 10.21771{col 27}{space 2} .8545459{col 38}{space 1}   11.96{col 47}{space 3}0.000{col 55}{space 4} 8.542834{col 68}{space 3} 11.89259
{txt}{space 5}exp_fe46 {c |}{col 15}{res}{space 2}  8.70319{col 27}{space 2}  .821919{col 38}{space 1}   10.59{col 47}{space 3}0.000{col 55}{space 4} 7.092259{col 68}{space 3} 10.31412
{txt}{space 5}exp_fe47 {c |}{col 15}{res}{space 2} 13.66895{col 27}{space 2} 1.009526{col 38}{space 1}   13.54{col 47}{space 3}0.000{col 55}{space 4} 11.69031{col 68}{space 3} 15.64758
{txt}{space 5}exp_fe48 {c |}{col 15}{res}{space 2} 7.614746{col 27}{space 2} 1.041188{col 38}{space 1}    7.31{col 47}{space 3}0.000{col 55}{space 4} 5.574056{col 68}{space 3} 9.655437
{txt}{space 5}exp_fe49 {c |}{col 15}{res}{space 2} 8.662271{col 27}{space 2} .8816125{col 38}{space 1}    9.83{col 47}{space 3}0.000{col 55}{space 4} 6.934342{col 68}{space 3}  10.3902
{txt}{space 5}exp_fe50 {c |}{col 15}{res}{space 2} 11.31579{col 27}{space 2} .9319483{col 38}{space 1}   12.14{col 47}{space 3}0.000{col 55}{space 4} 9.489208{col 68}{space 3} 13.14238
{txt}{space 6}imp_fe1 {c |}{col 15}{res}{space 2}-1.370312{col 27}{space 2} .3090052{col 38}{space 1}   -4.43{col 47}{space 3}0.000{col 55}{space 4}-1.975951{col 68}{space 3}-.7646731
{txt}{space 6}imp_fe2 {c |}{col 15}{res}{space 2}-1.110885{col 27}{space 2}  .313237{col 38}{space 1}   -3.55{col 47}{space 3}0.000{col 55}{space 4}-1.724819{col 68}{space 3}-.4969522
{txt}{space 6}imp_fe3 {c |}{col 15}{res}{space 2} .1646346{col 27}{space 2} .3229383{col 38}{space 1}    0.51{col 47}{space 3}0.610{col 55}{space 4}-.4683129{col 68}{space 3} .7975821
{txt}{space 6}imp_fe4 {c |}{col 15}{res}{space 2}-1.451248{col 27}{space 2} .3197457{col 38}{space 1}   -4.54{col 47}{space 3}0.000{col 55}{space 4}-2.077938{col 68}{space 3}-.8245576
{txt}{space 6}imp_fe5 {c |}{col 15}{res}{space 2}-1.216206{col 27}{space 2} .3134303{col 38}{space 1}   -3.88{col 47}{space 3}0.000{col 55}{space 4}-1.830518{col 68}{space 3}-.6018937
{txt}{space 6}imp_fe6 {c |}{col 15}{res}{space 2}-.5938577{col 27}{space 2}  .302246{col 38}{space 1}   -1.96{col 47}{space 3}0.049{col 55}{space 4}-1.186249{col 68}{space 3}-.0014665
{txt}{space 6}imp_fe7 {c |}{col 15}{res}{space 2} .5896569{col 27}{space 2} .3186067{col 38}{space 1}    1.85{col 47}{space 3}0.064{col 55}{space 4}-.0348008{col 68}{space 3} 1.214115
{txt}{space 6}imp_fe8 {c |}{col 15}{res}{space 2}-1.211781{col 27}{space 2} .3144322{col 38}{space 1}   -3.85{col 47}{space 3}0.000{col 55}{space 4}-1.828057{col 68}{space 3}-.5955052
{txt}{space 6}imp_fe9 {c |}{col 15}{res}{space 2}-.4904532{col 27}{space 2} .3252966{col 38}{space 1}   -1.51{col 47}{space 3}0.132{col 55}{space 4}-1.128023{col 68}{space 3} .1471164
{txt}{space 5}imp_fe10 {c |}{col 15}{res}{space 2}-.9805696{col 27}{space 2} .3031847{col 38}{space 1}   -3.23{col 47}{space 3}0.001{col 55}{space 4}-1.574801{col 68}{space 3}-.3863385
{txt}{space 5}imp_fe11 {c |}{col 15}{res}{space 2}  -1.8942{col 27}{space 2} .3370581{col 38}{space 1}   -5.62{col 47}{space 3}0.000{col 55}{space 4}-2.554822{col 68}{space 3}-1.233579
{txt}{space 5}imp_fe12 {c |}{col 15}{res}{space 2}-.2708697{col 27}{space 2} .2953773{col 38}{space 1}   -0.92{col 47}{space 3}0.359{col 55}{space 4}-.8497986{col 68}{space 3} .3080592
{txt}{space 5}imp_fe13 {c |}{col 15}{res}{space 2}-1.558538{col 27}{space 2} .3295201{col 38}{space 1}   -4.73{col 47}{space 3}0.000{col 55}{space 4}-2.204386{col 68}{space 3}-.9126906
{txt}{space 5}imp_fe14 {c |}{col 15}{res}{space 2}-1.921267{col 27}{space 2} .3700584{col 38}{space 1}   -5.19{col 47}{space 3}0.000{col 55}{space 4}-2.646568{col 68}{space 3}-1.195966
{txt}{space 5}imp_fe15 {c |}{col 15}{res}{space 2}-1.337245{col 27}{space 2}  .313288{col 38}{space 1}   -4.27{col 47}{space 3}0.000{col 55}{space 4}-1.951278{col 68}{space 3} -.723212
{txt}{space 5}imp_fe16 {c |}{col 15}{res}{space 2}-1.639062{col 27}{space 2}   .31207{col 38}{space 1}   -5.25{col 47}{space 3}0.000{col 55}{space 4}-2.250708{col 68}{space 3}-1.027416
{txt}{space 5}imp_fe17 {c |}{col 15}{res}{space 2}-.6217268{col 27}{space 2} .2916895{col 38}{space 1}   -2.13{col 47}{space 3}0.033{col 55}{space 4}-1.193428{col 68}{space 3}-.0500258
{txt}{space 5}imp_fe18 {c |}{col 15}{res}{space 2}-.6935303{col 27}{space 2} .3469103{col 38}{space 1}   -2.00{col 47}{space 3}0.046{col 55}{space 4}-1.373462{col 68}{space 3}-.0135987
{txt}{space 5}imp_fe19 {c |}{col 15}{res}{space 2}-1.457979{col 27}{space 2} .3104403{col 38}{space 1}   -4.70{col 47}{space 3}0.000{col 55}{space 4}-2.066431{col 68}{space 3}-.8495268
{txt}{space 5}imp_fe20 {c |}{col 15}{res}{space 2}-1.723081{col 27}{space 2} .3244819{col 38}{space 1}   -5.31{col 47}{space 3}0.000{col 55}{space 4}-2.359054{col 68}{space 3}-1.087109
{txt}{space 5}imp_fe21 {c |}{col 15}{res}{space 2}-2.488997{col 27}{space 2} .3409844{col 38}{space 1}   -7.30{col 47}{space 3}0.000{col 55}{space 4}-3.157314{col 68}{space 3} -1.82068
{txt}{space 5}imp_fe22 {c |}{col 15}{res}{space 2}-1.242093{col 27}{space 2}  .301451{col 38}{space 1}   -4.12{col 47}{space 3}0.000{col 55}{space 4}-1.832926{col 68}{space 3}-.6512602
{txt}{space 5}imp_fe23 {c |}{col 15}{res}{space 2}-1.670359{col 27}{space 2} .3471805{col 38}{space 1}   -4.81{col 47}{space 3}0.000{col 55}{space 4} -2.35082{col 68}{space 3}-.9898973
{txt}{space 5}imp_fe24 {c |}{col 15}{res}{space 2} -2.14023{col 27}{space 2}  .324903{col 38}{space 1}   -6.59{col 47}{space 3}0.000{col 55}{space 4}-2.777029{col 68}{space 3}-1.503432
{txt}{space 5}imp_fe25 {c |}{col 15}{res}{space 2}-2.703183{col 27}{space 2} .3840168{col 38}{space 1}   -7.04{col 47}{space 3}0.000{col 55}{space 4}-3.455842{col 68}{space 3}-1.950524
{txt}{space 5}imp_fe26 {c |}{col 15}{res}{space 2}-1.878524{col 27}{space 2} .3127091{col 38}{space 1}   -6.01{col 47}{space 3}0.000{col 55}{space 4}-2.491423{col 68}{space 3}-1.265626
{txt}{space 5}imp_fe27 {c |}{col 15}{res}{space 2}-.7532762{col 27}{space 2} .3278295{col 38}{space 1}   -2.30{col 47}{space 3}0.022{col 55}{space 4} -1.39581{col 68}{space 3}-.1107421
{txt}{space 5}imp_fe28 {c |}{col 15}{res}{space 2}-.5103834{col 27}{space 2} .3285109{col 38}{space 1}   -1.55{col 47}{space 3}0.120{col 55}{space 4}-1.154253{col 68}{space 3} .1334862
{txt}{space 5}imp_fe29 {c |}{col 15}{res}{space 2}-1.221737{col 27}{space 2} .3704174{col 38}{space 1}   -3.30{col 47}{space 3}0.001{col 55}{space 4}-1.947742{col 68}{space 3}-.4957324
{txt}{space 5}imp_fe30 {c |}{col 15}{res}{space 2}-.4688669{col 27}{space 2} .3234807{col 38}{space 1}   -1.45{col 47}{space 3}0.147{col 55}{space 4}-1.102878{col 68}{space 3} .1651436
{txt}{space 5}imp_fe31 {c |}{col 15}{res}{space 2}-.6105753{col 27}{space 2} .3437722{col 38}{space 1}   -1.78{col 47}{space 3}0.076{col 55}{space 4}-1.284356{col 68}{space 3} .0632058
{txt}{space 5}imp_fe32 {c |}{col 15}{res}{space 2} -1.55537{col 27}{space 2} .3300509{col 38}{space 1}   -4.71{col 47}{space 3}0.000{col 55}{space 4}-2.202258{col 68}{space 3} -.908482
{txt}{space 5}imp_fe33 {c |}{col 15}{res}{space 2}-.6391736{col 27}{space 2} .3319007{col 38}{space 1}   -1.93{col 47}{space 3}0.054{col 55}{space 4}-1.289687{col 68}{space 3} .0113399
{txt}{space 5}imp_fe34 {c |}{col 15}{res}{space 2}-1.911336{col 27}{space 2} .3407637{col 38}{space 1}   -5.61{col 47}{space 3}0.000{col 55}{space 4}-2.579221{col 68}{space 3}-1.243452
{txt}{space 5}imp_fe35 {c |}{col 15}{res}{space 2}-1.324903{col 27}{space 2} .3337143{col 38}{space 1}   -3.97{col 47}{space 3}0.000{col 55}{space 4}-1.978971{col 68}{space 3}-.6708352
{txt}{space 5}imp_fe36 {c |}{col 15}{res}{space 2}-1.645042{col 27}{space 2}   .33138{col 38}{space 1}   -4.96{col 47}{space 3}0.000{col 55}{space 4}-2.294535{col 68}{space 3}-.9955493
{txt}{space 5}imp_fe37 {c |}{col 15}{res}{space 2}-1.760417{col 27}{space 2} .3238268{col 38}{space 1}   -5.44{col 47}{space 3}0.000{col 55}{space 4}-2.395106{col 68}{space 3}-1.125728
{txt}{space 5}imp_fe38 {c |}{col 15}{res}{space 2} -1.93448{col 27}{space 2} .3459525{col 38}{space 1}   -5.59{col 47}{space 3}0.000{col 55}{space 4}-2.612535{col 68}{space 3}-1.256426
{txt}{space 5}imp_fe39 {c |}{col 15}{res}{space 2}-1.531538{col 27}{space 2} .3289779{col 38}{space 1}   -4.66{col 47}{space 3}0.000{col 55}{space 4}-2.176323{col 68}{space 3}-.8867532
{txt}{space 5}imp_fe40 {c |}{col 15}{res}{space 2}-1.513052{col 27}{space 2}  .305043{col 38}{space 1}   -4.96{col 47}{space 3}0.000{col 55}{space 4}-2.110925{col 68}{space 3} -.915179
{txt}{space 5}imp_fe41 {c |}{col 15}{res}{space 2}-.4065013{col 27}{space 2} .3124374{col 38}{space 1}   -1.30{col 47}{space 3}0.193{col 55}{space 4}-1.018867{col 68}{space 3} .2058648
{txt}{space 5}imp_fe42 {c |}{col 15}{res}{space 2}-3.248127{col 27}{space 2} .4077477{col 38}{space 1}   -7.97{col 47}{space 3}0.000{col 55}{space 4}-4.047298{col 68}{space 3}-2.448957
{txt}{space 5}imp_fe43 {c |}{col 15}{res}{space 2}-1.594825{col 27}{space 2} .3361572{col 38}{space 1}   -4.74{col 47}{space 3}0.000{col 55}{space 4}-2.253681{col 68}{space 3}-.9359693
{txt}{space 5}imp_fe44 {c |}{col 15}{res}{space 2}-1.080942{col 27}{space 2}  .294336{col 38}{space 1}   -3.67{col 47}{space 3}0.000{col 55}{space 4} -1.65783{col 68}{space 3}-.5040537
{txt}{space 5}imp_fe45 {c |}{col 15}{res}{space 2}-1.746495{col 27}{space 2} .3285365{col 38}{space 1}   -5.32{col 47}{space 3}0.000{col 55}{space 4}-2.390415{col 68}{space 3}-1.102575
{txt}{space 5}imp_fe46 {c |}{col 15}{res}{space 2}-2.633617{col 27}{space 2} .3408203{col 38}{space 1}   -7.73{col 47}{space 3}0.000{col 55}{space 4}-3.301613{col 68}{space 3}-1.965622
{txt}{space 5}imp_fe47 {c |}{col 15}{res}{space 2} 1.004498{col 27}{space 2}  .350903{col 38}{space 1}    2.86{col 47}{space 3}0.004{col 55}{space 4} .3167407{col 68}{space 3} 1.692255
{txt}{space 5}imp_fe48 {c |}{col 15}{res}{space 2}-1.648235{col 27}{space 2} .3430533{col 38}{space 1}   -4.80{col 47}{space 3}0.000{col 55}{space 4}-2.320608{col 68}{space 3}-.9758633
{txt}{space 5}imp_fe49 {c |}{col 15}{res}{space 2}-2.122249{col 27}{space 2} .3814635{col 38}{space 1}   -5.56{col 47}{space 3}0.000{col 55}{space 4}-2.869904{col 68}{space 3}-1.374595
{txt}{space 5}imp_fe50 {c |}{col 15}{res}{space 2}        0{col 27}{txt}  (omitted)
{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: 0 failures and 2 successes completely determined.{p_end}

{com}. estimates store probit_simple
{txt}
{com}. predict phat_standard
{txt}(option {bf:pr} assumed; Pr(traded))
(196 missing values generated)

{com}. 
. probit traded lndist contig comlang_ethno colony rta recip_exp transitive_count cyclical_count  exp_fe*  imp_fe*, vce(robust) noconstant

{txt}note: exp_fe10 != 0 predicts success perfectly
      exp_fe10 dropped and 49 obs not used

note: exp_fe12 != 0 predicts success perfectly
      exp_fe12 dropped and 49 obs not used

note: exp_fe14 != 0 predicts failure perfectly
      exp_fe14 dropped and 49 obs not used

note: exp_fe32 != 0 predicts failure perfectly
      exp_fe32 dropped and 49 obs not used

note: imp_fe50 omitted because of collinearity
{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-1562.3537}  
Iteration 1:{space 3}log pseudolikelihood = {res:-827.85025}  
Iteration 2:{space 3}log pseudolikelihood = {res:-802.42333}  
Iteration 3:{space 3}log pseudolikelihood = {res:-801.75824}  
Iteration 4:{space 3}log pseudolikelihood = {res:-801.75586}  
Iteration 5:{space 3}log pseudolikelihood = {res:-801.75586}  
{res}
{txt}Probit regression{col 49}Number of obs{col 67}= {res}     2,254
{txt}{col 49}Wald chi2({res}103{txt}){col 67}= {res}    737.54
{txt}Log pseudolikelihood = {res}-801.75586{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 18}{c |}{col 30}    Robust
{col 1}          traded{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}lndist {c |}{col 18}{res}{space 2}-1.078624{col 30}{space 2} .0985658{col 41}{space 1}  -10.94{col 50}{space 3}0.000{col 58}{space 4}-1.271809{col 71}{space 3}-.8854384
{txt}{space 10}contig {c |}{col 18}{res}{space 2}  .560648{col 30}{space 2} .2557475{col 41}{space 1}    2.19{col 50}{space 3}0.028{col 58}{space 4} .0593922{col 71}{space 3} 1.061904
{txt}{space 3}comlang_ethno {c |}{col 18}{res}{space 2} .3952237{col 30}{space 2} .1638447{col 41}{space 1}    2.41{col 50}{space 3}0.016{col 58}{space 4} .0740939{col 71}{space 3} .7163534
{txt}{space 10}colony {c |}{col 18}{res}{space 2} .8651457{col 30}{space 2} .2741887{col 41}{space 1}    3.16{col 50}{space 3}0.002{col 58}{space 4} .3277458{col 71}{space 3} 1.402546
{txt}{space 13}rta {c |}{col 18}{res}{space 2} -.041221{col 30}{space 2} .1393026{col 41}{space 1}   -0.30{col 50}{space 3}0.767{col 58}{space 4} -.314249{col 71}{space 3}  .231807
{txt}{space 7}recip_exp {c |}{col 18}{res}{space 2} .1093452{col 30}{space 2} .0970331{col 41}{space 1}    1.13{col 50}{space 3}0.260{col 58}{space 4}-.0808363{col 71}{space 3} .2995266
{txt}transitive_count {c |}{col 18}{res}{space 2}-.0793264{col 30}{space 2} .0245009{col 41}{space 1}   -3.24{col 50}{space 3}0.001{col 58}{space 4}-.1273473{col 71}{space 3}-.0313056
{txt}{space 2}cyclical_count {c |}{col 18}{res}{space 2}  .097738{col 30}{space 2} .0187154{col 41}{space 1}    5.22{col 50}{space 3}0.000{col 58}{space 4} .0610565{col 71}{space 3} .1344196
{txt}{space 9}exp_fe1 {c |}{col 18}{res}{space 2} 7.395694{col 30}{space 2} 1.041435{col 41}{space 1}    7.10{col 50}{space 3}0.000{col 58}{space 4} 5.354519{col 71}{space 3} 9.436869
{txt}{space 9}exp_fe2 {c |}{col 18}{res}{space 2} 9.099821{col 30}{space 2} 1.151523{col 41}{space 1}    7.90{col 50}{space 3}0.000{col 58}{space 4} 6.842879{col 71}{space 3} 11.35676
{txt}{space 9}exp_fe3 {c |}{col 18}{res}{space 2} 10.23532{col 30}{space 2} 1.277291{col 41}{space 1}    8.01{col 50}{space 3}0.000{col 58}{space 4} 7.731878{col 71}{space 3} 12.73877
{txt}{space 9}exp_fe4 {c |}{col 18}{res}{space 2}  10.5014{col 30}{space 2} 1.297041{col 41}{space 1}    8.10{col 50}{space 3}0.000{col 58}{space 4}  7.95925{col 71}{space 3} 13.04356
{txt}{space 9}exp_fe5 {c |}{col 18}{res}{space 2} 10.58059{col 30}{space 2} 1.282775{col 41}{space 1}    8.25{col 50}{space 3}0.000{col 58}{space 4} 8.066402{col 71}{space 3} 13.09479
{txt}{space 9}exp_fe6 {c |}{col 18}{res}{space 2} 11.38809{col 30}{space 2}  1.32413{col 41}{space 1}    8.60{col 50}{space 3}0.000{col 58}{space 4} 8.792844{col 71}{space 3} 13.98334
{txt}{space 9}exp_fe7 {c |}{col 18}{res}{space 2} 10.62914{col 30}{space 2} 1.345726{col 41}{space 1}    7.90{col 50}{space 3}0.000{col 58}{space 4}  7.99157{col 71}{space 3} 13.26672
{txt}{space 9}exp_fe8 {c |}{col 18}{res}{space 2} 10.53089{col 30}{space 2} 1.302482{col 41}{space 1}    8.09{col 50}{space 3}0.000{col 58}{space 4} 7.978073{col 71}{space 3} 13.08371
{txt}{space 9}exp_fe9 {c |}{col 18}{res}{space 2} 9.395799{col 30}{space 2} 1.199631{col 41}{space 1}    7.83{col 50}{space 3}0.000{col 58}{space 4} 7.044566{col 71}{space 3} 11.74703
{txt}{space 8}exp_fe10 {c |}{col 18}{res}{space 2}        0{col 30}{txt}  (omitted)
{space 8}exp_fe11 {c |}{col 18}{res}{space 2} 11.16761{col 30}{space 2} 1.307696{col 41}{space 1}    8.54{col 50}{space 3}0.000{col 58}{space 4} 8.604574{col 71}{space 3} 13.73065
{txt}{space 8}exp_fe12 {c |}{col 18}{res}{space 2}        0{col 30}{txt}  (omitted)
{space 8}exp_fe13 {c |}{col 18}{res}{space 2}  10.9762{col 30}{space 2} 1.323249{col 41}{space 1}    8.29{col 50}{space 3}0.000{col 58}{space 4}  8.38268{col 71}{space 3} 13.56972
{txt}{space 8}exp_fe14 {c |}{col 18}{res}{space 2}        0{col 30}{txt}  (omitted)
{space 8}exp_fe15 {c |}{col 18}{res}{space 2} 11.28923{col 30}{space 2} 1.317583{col 41}{space 1}    8.57{col 50}{space 3}0.000{col 58}{space 4} 8.706815{col 71}{space 3} 13.87165
{txt}{space 8}exp_fe16 {c |}{col 18}{res}{space 2}  9.57416{col 30}{space 2} 1.225493{col 41}{space 1}    7.81{col 50}{space 3}0.000{col 58}{space 4} 7.172237{col 71}{space 3} 11.97608
{txt}{space 8}exp_fe17 {c |}{col 18}{res}{space 2} 12.89598{col 30}{space 2} 1.410902{col 41}{space 1}    9.14{col 50}{space 3}0.000{col 58}{space 4} 10.13066{col 71}{space 3} 15.66129
{txt}{space 8}exp_fe18 {c |}{col 18}{res}{space 2} 11.89298{col 30}{space 2} 1.385535{col 41}{space 1}    8.58{col 50}{space 3}0.000{col 58}{space 4}  9.17738{col 71}{space 3} 14.60858
{txt}{space 8}exp_fe19 {c |}{col 18}{res}{space 2} 7.673042{col 30}{space 2} 1.107205{col 41}{space 1}    6.93{col 50}{space 3}0.000{col 58}{space 4} 5.502961{col 71}{space 3} 9.843123
{txt}{space 8}exp_fe20 {c |}{col 18}{res}{space 2} 12.00647{col 30}{space 2} 1.392355{col 41}{space 1}    8.62{col 50}{space 3}0.000{col 58}{space 4}  9.27751{col 71}{space 3} 14.73544
{txt}{space 8}exp_fe21 {c |}{col 18}{res}{space 2} 9.806421{col 30}{space 2}  1.20442{col 41}{space 1}    8.14{col 50}{space 3}0.000{col 58}{space 4}   7.4458{col 71}{space 3} 12.16704
{txt}{space 8}exp_fe22 {c |}{col 18}{res}{space 2} 9.689648{col 30}{space 2} 1.169114{col 41}{space 1}    8.29{col 50}{space 3}0.000{col 58}{space 4} 7.398228{col 71}{space 3} 11.98107
{txt}{space 8}exp_fe23 {c |}{col 18}{res}{space 2} 10.85929{col 30}{space 2} 1.239058{col 41}{space 1}    8.76{col 50}{space 3}0.000{col 58}{space 4} 8.430776{col 71}{space 3} 13.28779
{txt}{space 8}exp_fe24 {c |}{col 18}{res}{space 2}   9.6264{col 30}{space 2} 1.212582{col 41}{space 1}    7.94{col 50}{space 3}0.000{col 58}{space 4} 7.249783{col 71}{space 3} 12.00302
{txt}{space 8}exp_fe25 {c |}{col 18}{res}{space 2}  8.11137{col 30}{space 2} 1.018719{col 41}{space 1}    7.96{col 50}{space 3}0.000{col 58}{space 4} 6.114717{col 71}{space 3} 10.10802
{txt}{space 8}exp_fe26 {c |}{col 18}{res}{space 2} 8.506509{col 30}{space 2} 1.144154{col 41}{space 1}    7.43{col 50}{space 3}0.000{col 58}{space 4} 6.264009{col 71}{space 3} 10.74901
{txt}{space 8}exp_fe27 {c |}{col 18}{res}{space 2} 11.22296{col 30}{space 2} 1.338364{col 41}{space 1}    8.39{col 50}{space 3}0.000{col 58}{space 4}  8.59981{col 71}{space 3}  13.8461
{txt}{space 8}exp_fe28 {c |}{col 18}{res}{space 2} 11.74276{col 30}{space 2} 1.355157{col 41}{space 1}    8.67{col 50}{space 3}0.000{col 58}{space 4} 9.086701{col 71}{space 3} 14.39882
{txt}{space 8}exp_fe29 {c |}{col 18}{res}{space 2} 11.43637{col 30}{space 2} 1.289362{col 41}{space 1}    8.87{col 50}{space 3}0.000{col 58}{space 4} 8.909263{col 71}{space 3} 13.96347
{txt}{space 8}exp_fe30 {c |}{col 18}{res}{space 2} 8.429101{col 30}{space 2} 1.193824{col 41}{space 1}    7.06{col 50}{space 3}0.000{col 58}{space 4}  6.08925{col 71}{space 3} 10.76895
{txt}{space 8}exp_fe31 {c |}{col 18}{res}{space 2} 10.32765{col 30}{space 2} 1.251729{col 41}{space 1}    8.25{col 50}{space 3}0.000{col 58}{space 4} 7.874309{col 71}{space 3}   12.781
{txt}{space 8}exp_fe32 {c |}{col 18}{res}{space 2}        0{col 30}{txt}  (omitted)
{space 8}exp_fe33 {c |}{col 18}{res}{space 2} 12.04707{col 30}{space 2} 1.338864{col 41}{space 1}    9.00{col 50}{space 3}0.000{col 58}{space 4} 9.422941{col 71}{space 3} 14.67119
{txt}{space 8}exp_fe34 {c |}{col 18}{res}{space 2} 9.655859{col 30}{space 2} 1.214214{col 41}{space 1}    7.95{col 50}{space 3}0.000{col 58}{space 4} 7.276044{col 71}{space 3} 12.03567
{txt}{space 8}exp_fe35 {c |}{col 18}{res}{space 2} 8.567613{col 30}{space 2} 1.124542{col 41}{space 1}    7.62{col 50}{space 3}0.000{col 58}{space 4} 6.363551{col 71}{space 3} 10.77168
{txt}{space 8}exp_fe36 {c |}{col 18}{res}{space 2} 9.870469{col 30}{space 2} 1.241968{col 41}{space 1}    7.95{col 50}{space 3}0.000{col 58}{space 4} 7.436256{col 71}{space 3} 12.30468
{txt}{space 8}exp_fe37 {c |}{col 18}{res}{space 2} 8.621165{col 30}{space 2} 1.139726{col 41}{space 1}    7.56{col 50}{space 3}0.000{col 58}{space 4} 6.387342{col 71}{space 3} 10.85499
{txt}{space 8}exp_fe38 {c |}{col 18}{res}{space 2} 7.611804{col 30}{space 2} 1.063342{col 41}{space 1}    7.16{col 50}{space 3}0.000{col 58}{space 4} 5.527691{col 71}{space 3} 9.695916
{txt}{space 8}exp_fe39 {c |}{col 18}{res}{space 2} 9.230996{col 30}{space 2} 1.119647{col 41}{space 1}    8.24{col 50}{space 3}0.000{col 58}{space 4} 7.036529{col 71}{space 3} 11.42546
{txt}{space 8}exp_fe40 {c |}{col 18}{res}{space 2} 7.313919{col 30}{space 2} 1.062504{col 41}{space 1}    6.88{col 50}{space 3}0.000{col 58}{space 4} 5.231449{col 71}{space 3} 9.396389
{txt}{space 8}exp_fe41 {c |}{col 18}{res}{space 2} 10.94206{col 30}{space 2} 1.332553{col 41}{space 1}    8.21{col 50}{space 3}0.000{col 58}{space 4} 8.330305{col 71}{space 3} 13.55382
{txt}{space 8}exp_fe42 {c |}{col 18}{res}{space 2} 9.121442{col 30}{space 2} 1.107805{col 41}{space 1}    8.23{col 50}{space 3}0.000{col 58}{space 4} 6.950183{col 71}{space 3}  11.2927
{txt}{space 8}exp_fe43 {c |}{col 18}{res}{space 2} 12.23754{col 30}{space 2} 1.374532{col 41}{space 1}    8.90{col 50}{space 3}0.000{col 58}{space 4} 9.543507{col 71}{space 3} 14.93157
{txt}{space 8}exp_fe44 {c |}{col 18}{res}{space 2} 11.86841{col 30}{space 2} 1.366094{col 41}{space 1}    8.69{col 50}{space 3}0.000{col 58}{space 4} 9.190913{col 71}{space 3}  14.5459
{txt}{space 8}exp_fe45 {c |}{col 18}{res}{space 2} 10.16057{col 30}{space 2} 1.224525{col 41}{space 1}    8.30{col 50}{space 3}0.000{col 58}{space 4} 7.760542{col 71}{space 3} 12.56059
{txt}{space 8}exp_fe46 {c |}{col 18}{res}{space 2} 8.063121{col 30}{space 2} .9970318{col 41}{space 1}    8.09{col 50}{space 3}0.000{col 58}{space 4} 6.108975{col 71}{space 3} 10.01727
{txt}{space 8}exp_fe47 {c |}{col 18}{res}{space 2} 13.67333{col 30}{space 2} 1.504534{col 41}{space 1}    9.09{col 50}{space 3}0.000{col 58}{space 4}  10.7245{col 71}{space 3} 16.62216
{txt}{space 8}exp_fe48 {c |}{col 18}{res}{space 2} 6.723228{col 30}{space 2} 1.136276{col 41}{space 1}    5.92{col 50}{space 3}0.000{col 58}{space 4} 4.496167{col 71}{space 3} 8.950288
{txt}{space 8}exp_fe49 {c |}{col 18}{res}{space 2} 8.203977{col 30}{space 2} 1.078215{col 41}{space 1}    7.61{col 50}{space 3}0.000{col 58}{space 4} 6.090715{col 71}{space 3} 10.31724
{txt}{space 8}exp_fe50 {c |}{col 18}{res}{space 2} 10.99631{col 30}{space 2} 1.347392{col 41}{space 1}    8.16{col 50}{space 3}0.000{col 58}{space 4} 8.355473{col 71}{space 3} 13.63715
{txt}{space 9}imp_fe1 {c |}{col 18}{res}{space 2}-.2271891{col 30}{space 2} .4110244{col 41}{space 1}   -0.55{col 50}{space 3}0.580{col 58}{space 4}-1.032782{col 71}{space 3}  .578404
{txt}{space 9}imp_fe2 {c |}{col 18}{res}{space 2}-.3788892{col 30}{space 2} .4039784{col 41}{space 1}   -0.94{col 50}{space 3}0.348{col 58}{space 4}-1.170672{col 71}{space 3} .4128939
{txt}{space 9}imp_fe3 {c |}{col 18}{res}{space 2} .6415186{col 30}{space 2} .3267067{col 41}{space 1}    1.96{col 50}{space 3}0.050{col 58}{space 4} .0011852{col 71}{space 3} 1.281852
{txt}{space 9}imp_fe4 {c |}{col 18}{res}{space 2} -1.75893{col 30}{space 2} .3275179{col 41}{space 1}   -5.37{col 50}{space 3}0.000{col 58}{space 4}-2.400853{col 71}{space 3}-1.117006
{txt}{space 9}imp_fe5 {c |}{col 18}{res}{space 2}-1.487522{col 30}{space 2} .3238285{col 41}{space 1}   -4.59{col 50}{space 3}0.000{col 58}{space 4}-2.122215{col 71}{space 3}-.8528303
{txt}{space 9}imp_fe6 {c |}{col 18}{res}{space 2}-.7404219{col 30}{space 2} .3175488{col 41}{space 1}   -2.33{col 50}{space 3}0.020{col 58}{space 4}-1.362806{col 71}{space 3}-.1180378
{txt}{space 9}imp_fe7 {c |}{col 18}{res}{space 2} .5801712{col 30}{space 2} .3094957{col 41}{space 1}    1.87{col 50}{space 3}0.061{col 58}{space 4}-.0264293{col 71}{space 3} 1.186772
{txt}{space 9}imp_fe8 {c |}{col 18}{res}{space 2}-1.499199{col 30}{space 2} .3259772{col 41}{space 1}   -4.60{col 50}{space 3}0.000{col 58}{space 4}-2.138102{col 71}{space 3}-.8602951
{txt}{space 9}imp_fe9 {c |}{col 18}{res}{space 2} .3868859{col 30}{space 2} .3921156{col 41}{space 1}    0.99{col 50}{space 3}0.324{col 58}{space 4}-.3816464{col 71}{space 3} 1.155418
{txt}{space 8}imp_fe10 {c |}{col 18}{res}{space 2}-1.953084{col 30}{space 2} .3585785{col 41}{space 1}   -5.45{col 50}{space 3}0.000{col 58}{space 4}-2.655885{col 71}{space 3}-1.250283
{txt}{space 8}imp_fe11 {c |}{col 18}{res}{space 2} -2.54783{col 30}{space 2} .3695833{col 41}{space 1}   -6.89{col 50}{space 3}0.000{col 58}{space 4}  -3.2722{col 71}{space 3}-1.823459
{txt}{space 8}imp_fe12 {c |}{col 18}{res}{space 2}-.8412079{col 30}{space 2} .3044201{col 41}{space 1}   -2.76{col 50}{space 3}0.006{col 58}{space 4} -1.43786{col 71}{space 3}-.2445554
{txt}{space 8}imp_fe13 {c |}{col 18}{res}{space 2}-2.074709{col 30}{space 2} .3425818{col 41}{space 1}   -6.06{col 50}{space 3}0.000{col 58}{space 4}-2.746157{col 71}{space 3}-1.403261
{txt}{space 8}imp_fe14 {c |}{col 18}{res}{space 2}-.7234432{col 30}{space 2} .5007787{col 41}{space 1}   -1.44{col 50}{space 3}0.149{col 58}{space 4}-1.704951{col 71}{space 3}  .258065
{txt}{space 8}imp_fe15 {c |}{col 18}{res}{space 2}-1.767724{col 30}{space 2} .3270257{col 41}{space 1}   -5.41{col 50}{space 3}0.000{col 58}{space 4}-2.408683{col 71}{space 3}-1.126766
{txt}{space 8}imp_fe16 {c |}{col 18}{res}{space 2}-1.599191{col 30}{space 2} .3241226{col 41}{space 1}   -4.93{col 50}{space 3}0.000{col 58}{space 4} -2.23446{col 71}{space 3}-.9639228
{txt}{space 8}imp_fe17 {c |}{col 18}{res}{space 2}-1.225283{col 30}{space 2} .3060281{col 41}{space 1}   -4.00{col 50}{space 3}0.000{col 58}{space 4}-1.825087{col 71}{space 3}-.6254792
{txt}{space 8}imp_fe18 {c |}{col 18}{res}{space 2}-1.202445{col 30}{space 2} .3430115{col 41}{space 1}   -3.51{col 50}{space 3}0.000{col 58}{space 4}-1.874735{col 71}{space 3}-.5301548
{txt}{space 8}imp_fe19 {c |}{col 18}{res}{space 2}  -.54518{col 30}{space 2}  .373322{col 41}{space 1}   -1.46{col 50}{space 3}0.144{col 58}{space 4}-1.276878{col 71}{space 3} .1865178
{txt}{space 8}imp_fe20 {c |}{col 18}{res}{space 2}-2.640623{col 30}{space 2}   .39183{col 41}{space 1}   -6.74{col 50}{space 3}0.000{col 58}{space 4}-3.408596{col 71}{space 3}-1.872651
{txt}{space 8}imp_fe21 {c |}{col 18}{res}{space 2}-2.779715{col 30}{space 2} .3984147{col 41}{space 1}   -6.98{col 50}{space 3}0.000{col 58}{space 4}-3.560594{col 71}{space 3}-1.998837
{txt}{space 8}imp_fe22 {c |}{col 18}{res}{space 2}-.8483267{col 30}{space 2} .3637731{col 41}{space 1}   -2.33{col 50}{space 3}0.020{col 58}{space 4}-1.561309{col 71}{space 3}-.1353445
{txt}{space 8}imp_fe23 {c |}{col 18}{res}{space 2}-1.955682{col 30}{space 2} .3933612{col 41}{space 1}   -4.97{col 50}{space 3}0.000{col 58}{space 4}-2.726655{col 71}{space 3}-1.184708
{txt}{space 8}imp_fe24 {c |}{col 18}{res}{space 2}-2.205293{col 30}{space 2}  .377535{col 41}{space 1}   -5.84{col 50}{space 3}0.000{col 58}{space 4}-2.945248{col 71}{space 3}-1.465338
{txt}{space 8}imp_fe25 {c |}{col 18}{res}{space 2}-2.271079{col 30}{space 2} .6282211{col 41}{space 1}   -3.62{col 50}{space 3}0.000{col 58}{space 4}-3.502369{col 71}{space 3}-1.039788
{txt}{space 8}imp_fe26 {c |}{col 18}{res}{space 2}-1.358469{col 30}{space 2} .3779811{col 41}{space 1}   -3.59{col 50}{space 3}0.000{col 58}{space 4}-2.099298{col 71}{space 3}-.6176398
{txt}{space 8}imp_fe27 {c |}{col 18}{res}{space 2}-1.166454{col 30}{space 2} .3238195{col 41}{space 1}   -3.60{col 50}{space 3}0.000{col 58}{space 4}-1.801129{col 71}{space 3}-.5317796
{txt}{space 8}imp_fe28 {c |}{col 18}{res}{space 2} -.960054{col 30}{space 2}  .341198{col 41}{space 1}   -2.81{col 50}{space 3}0.005{col 58}{space 4} -1.62879{col 71}{space 3}-.2913182
{txt}{space 8}imp_fe29 {c |}{col 18}{res}{space 2}-1.651675{col 30}{space 2} .4315993{col 41}{space 1}   -3.83{col 50}{space 3}0.000{col 58}{space 4}-2.497594{col 71}{space 3}-.8057562
{txt}{space 8}imp_fe30 {c |}{col 18}{res}{space 2} .4647683{col 30}{space 2} .3868038{col 41}{space 1}    1.20{col 50}{space 3}0.230{col 58}{space 4}-.2933532{col 71}{space 3}  1.22289
{txt}{space 8}imp_fe31 {c |}{col 18}{res}{space 2}-.4405847{col 30}{space 2}  .355009{col 41}{space 1}   -1.24{col 50}{space 3}0.215{col 58}{space 4} -1.13639{col 71}{space 3} .2552202
{txt}{space 8}imp_fe32 {c |}{col 18}{res}{space 2}-.3844105{col 30}{space 2} .4641072{col 41}{space 1}   -0.83{col 50}{space 3}0.408{col 58}{space 4}-1.294044{col 71}{space 3}  .525223
{txt}{space 8}imp_fe33 {c |}{col 18}{res}{space 2}-1.135725{col 30}{space 2} .3492086{col 41}{space 1}   -3.25{col 50}{space 3}0.001{col 58}{space 4}-1.820162{col 71}{space 3}-.4512891
{txt}{space 8}imp_fe34 {c |}{col 18}{res}{space 2}-2.047311{col 30}{space 2} .3833777{col 41}{space 1}   -5.34{col 50}{space 3}0.000{col 58}{space 4}-2.798718{col 71}{space 3}-1.295905
{txt}{space 8}imp_fe35 {c |}{col 18}{res}{space 2} -.503675{col 30}{space 2} .4150279{col 41}{space 1}   -1.21{col 50}{space 3}0.225{col 58}{space 4}-1.317115{col 71}{space 3} .3097648
{txt}{space 8}imp_fe36 {c |}{col 18}{res}{space 2}-1.765456{col 30}{space 2} .3504134{col 41}{space 1}   -5.04{col 50}{space 3}0.000{col 58}{space 4}-2.452254{col 71}{space 3}-1.078659
{txt}{space 8}imp_fe37 {c |}{col 18}{res}{space 2}-1.338023{col 30}{space 2} .3839639{col 41}{space 1}   -3.48{col 50}{space 3}0.000{col 58}{space 4}-2.090578{col 71}{space 3}-.5854673
{txt}{space 8}imp_fe38 {c |}{col 18}{res}{space 2}-1.077101{col 30}{space 2} .4158317{col 41}{space 1}   -2.59{col 50}{space 3}0.010{col 58}{space 4}-1.892116{col 71}{space 3} -.262086
{txt}{space 8}imp_fe39 {c |}{col 18}{res}{space 2}-.9919308{col 30}{space 2}  .369488{col 41}{space 1}   -2.68{col 50}{space 3}0.007{col 58}{space 4}-1.716114{col 71}{space 3}-.2677476
{txt}{space 8}imp_fe40 {c |}{col 18}{res}{space 2}  -.46461{col 30}{space 2} .4165889{col 41}{space 1}   -1.12{col 50}{space 3}0.265{col 58}{space 4}-1.281109{col 71}{space 3} .3518892
{txt}{space 8}imp_fe41 {c |}{col 18}{res}{space 2}-.5502858{col 30}{space 2} .3104577{col 41}{space 1}   -1.77{col 50}{space 3}0.076{col 58}{space 4}-1.158772{col 71}{space 3} .0582002
{txt}{space 8}imp_fe42 {c |}{col 18}{res}{space 2}-3.283228{col 30}{space 2} .5378752{col 41}{space 1}   -6.10{col 50}{space 3}0.000{col 58}{space 4}-4.337444{col 71}{space 3}-2.229012
{txt}{space 8}imp_fe43 {c |}{col 18}{res}{space 2}-2.371927{col 30}{space 2}  .376025{col 41}{space 1}   -6.31{col 50}{space 3}0.000{col 58}{space 4}-3.108922{col 71}{space 3}-1.634931
{txt}{space 8}imp_fe44 {c |}{col 18}{res}{space 2}-1.742944{col 30}{space 2} .3330622{col 41}{space 1}   -5.23{col 50}{space 3}0.000{col 58}{space 4}-2.395734{col 71}{space 3}-1.090155
{txt}{space 8}imp_fe45 {c |}{col 18}{res}{space 2} -1.90571{col 30}{space 2} .3586006{col 41}{space 1}   -5.31{col 50}{space 3}0.000{col 58}{space 4}-2.608554{col 71}{space 3}-1.202865
{txt}{space 8}imp_fe46 {c |}{col 18}{res}{space 2}-1.988465{col 30}{space 2}  .462491{col 41}{space 1}   -4.30{col 50}{space 3}0.000{col 58}{space 4} -2.89493{col 71}{space 3}-1.081999
{txt}{space 8}imp_fe47 {c |}{col 18}{res}{space 2} .5440626{col 30}{space 2} .3513855{col 41}{space 1}    1.55{col 50}{space 3}0.122{col 58}{space 4}-.1446404{col 71}{space 3} 1.232765
{txt}{space 8}imp_fe48 {c |}{col 18}{res}{space 2}-.7416496{col 30}{space 2} .5009374{col 41}{space 1}   -1.48{col 50}{space 3}0.139{col 58}{space 4}-1.723469{col 71}{space 3} .2401696
{txt}{space 8}imp_fe49 {c |}{col 18}{res}{space 2}-1.569789{col 30}{space 2} .5241124{col 41}{space 1}   -3.00{col 50}{space 3}0.003{col 58}{space 4} -2.59703{col 71}{space 3}-.5425472
{txt}{space 8}imp_fe50 {c |}{col 18}{res}{space 2}        0{col 30}{txt}  (omitted)
{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: 0 failures and 3 successes completely determined.{p_end}

{com}. estimates store probit_network
{txt}
{com}. predict phat_bilat_ntwk
{txt}(option {bf:pr} assumed; Pr(traded))
(196 missing values generated)

{com}. 
. * Define some later constraints
. local dist_b = _b[lndist]
{txt}
{com}. constraint define 1 lndist = `dist_b'
{txt}
{com}. 
. local contig_b = _b[contig]
{txt}
{com}. constraint define 2 contig = `contig_b'
{txt}
{com}. 
. local comlang_ethno_b = _b[comlang_ethno]
{txt}
{com}. constraint define 3 comlang_ethno = `comlang_ethno_b'
{txt}
{com}. 
. local colony_b = _b[colony]
{txt}
{com}. constraint define 4 colony = `colony_b'
{txt}
{com}. 
. local rta_b = _b[rta]
{txt}
{com}. constraint define 5 rta = `rta_b'
{txt}
{com}. 
. local recip_b = _b[recip_exp]
{txt}
{com}. constraint define 6 recip_exp = `recip_b'
{txt}
{com}. 
. local trans_b = _b[transitive_count]
{txt}
{com}. constraint define 7 transitive_count = `trans_b'
{txt}
{com}. 
. local cyclic_b =_b[cyclical_count]
{txt}
{com}. constraint define 8 cyclical_count = `cyclic_b'
{txt}
{com}. 
. 
. probit traded lndist contig comlang_ethno colony rta recip_exp transitive_count cyclical_count importer_imp_degree importer_exp_degree exporter_exp_degree exporter_imp_degree lngdp_o  lngdp_d lngdpcap_o lngdpcap_d lnremoteness_o lnremoteness_d , vce(robust) constraints(1/8)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-22657.716}  
Iteration 1:{space 3}log pseudolikelihood = {res:-2134.7018}  
Iteration 2:{space 3}log pseudolikelihood = {res:-908.53928}  
Iteration 3:{space 3}log pseudolikelihood = {res: -878.2255}  
Iteration 4:{space 3}log pseudolikelihood = {res:-878.07524}  
Iteration 5:{space 3}log pseudolikelihood = {res:-878.07522}  
{res}
{txt}Probit regression{col 49}Number of obs{col 67}= {res}     2,162
{txt}{col 49}Wald chi2({res}10{txt}){col 67}= {res}   1536.27
{txt}Log pseudolikelihood = {res}-878.07522{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000

{p 0 7}{space 1}{text:( 1)}{space 1} [traded]lndist = -1.078624{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} [traded]contig = .560648{p_end}
{p 0 7}{space 1}{text:( 3)}{space 1} [traded]comlang_ethno = .3952237{p_end}
{p 0 7}{space 1}{text:( 4)}{space 1} [traded]colony = .8651457{p_end}
{p 0 7}{space 1}{text:( 5)}{space 1} [traded]rta = -.041221{p_end}
{p 0 7}{space 1}{text:( 6)}{space 1} [traded]recip_exp = .1093452{p_end}
{p 0 7}{space 1}{text:( 7)}{space 1} [traded]transitive_count = -.0793264{p_end}
{p 0 7}{space 1}{text:( 8)}{space 1} [traded]cyclical_count = .097738{p_end}
{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}    Robust
{col 1}             traded{col 21}{c |}      Coef.{col 33}   Std. Err.{col 45}      z{col 53}   P>|z|{col 61}     [95% Con{col 74}f. Interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}lndist {c |}{col 21}{res}{space 2}-1.078624{col 33}{txt}  (constrained)
{space 13}contig {c |}{col 21}{res}{space 2}  .560648{col 33}{txt}  (constrained)
{space 6}comlang_ethno {c |}{col 21}{res}{space 2} .3952237{col 33}{txt}  (constrained)
{space 13}colony {c |}{col 21}{res}{space 2} .8651457{col 33}{txt}  (constrained)
{space 16}rta {c |}{col 21}{res}{space 2} -.041221{col 33}{txt}  (constrained)
{space 10}recip_exp {c |}{col 21}{res}{space 2} .1093452{col 33}{txt}  (constrained)
{space 3}transitive_count {c |}{col 21}{res}{space 2}-.0793264{col 33}{txt}  (constrained)
{space 5}cyclical_count {c |}{col 21}{res}{space 2}  .097738{col 33}{txt}  (constrained)
importer_imp_degree {c |}{col 21}{res}{space 2} .1059886{col 33}{space 2} .0102123{col 44}{space 1}   10.38{col 53}{space 3}0.000{col 61}{space 4} .0859729{col 74}{space 3} .1260044
{txt}importer_exp_degree {c |}{col 21}{res}{space 2}-.0485225{col 33}{space 2} .0041141{col 44}{space 1}  -11.79{col 53}{space 3}0.000{col 61}{space 4}-.0565861{col 74}{space 3}-.0404589
{txt}exporter_exp_degree {c |}{col 21}{res}{space 2} .1203952{col 33}{space 2} .0047725{col 44}{space 1}   25.23{col 53}{space 3}0.000{col 61}{space 4} .1110414{col 74}{space 3} .1297491
{txt}exporter_imp_degree {c |}{col 21}{res}{space 2}-.0347754{col 33}{space 2} .0094969{col 44}{space 1}   -3.66{col 53}{space 3}0.000{col 61}{space 4} -.053389{col 74}{space 3}-.0161618
{txt}{space 12}lngdp_o {c |}{col 21}{res}{space 2} .0389168{col 33}{space 2} .0505433{col 44}{space 1}    0.77{col 53}{space 3}0.441{col 61}{space 4}-.0601462{col 74}{space 3} .1379797
{txt}{space 12}lngdp_d {c |}{col 21}{res}{space 2} .1564124{col 33}{space 2} .0519893{col 44}{space 1}    3.01{col 53}{space 3}0.003{col 61}{space 4} .0545152{col 74}{space 3} .2583096
{txt}{space 9}lngdpcap_o {c |}{col 21}{res}{space 2}  .160303{col 33}{space 2} .0417013{col 44}{space 1}    3.84{col 53}{space 3}0.000{col 61}{space 4} .0785699{col 74}{space 3} .2420361
{txt}{space 9}lngdpcap_d {c |}{col 21}{res}{space 2} .0650305{col 33}{space 2} .0441348{col 44}{space 1}    1.47{col 53}{space 3}0.141{col 61}{space 4} -.021472{col 74}{space 3} .1515331
{txt}{space 5}lnremoteness_o {c |}{col 21}{res}{space 2} .8357066{col 33}{space 2} .0805136{col 44}{space 1}   10.38{col 53}{space 3}0.000{col 61}{space 4} .6779029{col 74}{space 3} .9935104
{txt}{space 5}lnremoteness_d {c |}{col 21}{res}{space 2} .7629339{col 33}{space 2} .0819526{col 44}{space 1}    9.31{col 53}{space 3}0.000{col 61}{space 4} .6023097{col 74}{space 3}  .923558
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 15.75094{col 33}{space 2} 1.465516{col 44}{space 1}   10.75{col 53}{space 3}0.000{col 61}{space 4} 12.87858{col 74}{space 3}  18.6233
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: 0 failures and 1 success completely determined.{p_end}

{com}. estimates store probit_network_noFE
{txt}
{com}. predict phat_all_ntwk
{txt}(option {bf:pr} assumed; Pr(traded))
(288 missing values generated)

{com}. 
. 
. export delimited exporter importer year traded phat_standard phat_bilat_ntwk phat_all_ntwk using "2006_probit_predicted_probabilities_subset_network_stats", replace
{res}{txt}file 2006_probit_predicted_probabilities_subset_network_stats.csv saved

{com}. 
. 
. esttab probit_simple probit_network probit_network_noFE using 2006_partial_probit_stata_output.txt, se aic pr2 scalars(ll) star(* 0.1 ** 0.05 *** 0.01) replace drop(exp_fe* imp_fe*) compress
{res}{txt}(output written to {browse  `"2006_partial_probit_stata_output.txt"'})

{com}. 
. 
. 
{txt}end of do-file

{com}. exit, clear
